In [2]:
people = {
    "first": ["Corey", 'Jane', 'John'], 
    "last": ["Schafer", 'Doe', 'Doe'], 
    "email": ["CoreyMSchafer@gmail.com", 'JaneDoe@email.com', 'JohnDoe@email.com']
}

In [3]:
import pandas as pd

In [4]:
df = pd.DataFrame(people)

In [5]:
df

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@email.com
2   John      Doe        JohnDoe@email.com

In [6]:
df.columns

Index(['first', 'last', 'email'], dtype='object')

In [7]:
df.columns = ['first_name', 'last_name', 'email'] #change the column name

In [8]:
df

  first_name last_name                    email
0      Corey   Schafer  CoreyMSchafer@gmail.com
1       Jane       Doe        JaneDoe@email.com
2       John       Doe        JohnDoe@email.com

In [9]:
df.columns = [x.upper() for x in df.columns]

In [10]:
df

  FIRST_NAME LAST_NAME                    EMAIL
0      Corey   Schafer  CoreyMSchafer@gmail.com
1       Jane       Doe        JaneDoe@email.com
2       John       Doe        JohnDoe@email.com

In [11]:
#replace spaces
#df.columns = df.columns.str.replace(' ', '_')

In [12]:
df

  FIRST_NAME LAST_NAME                    EMAIL
0      Corey   Schafer  CoreyMSchafer@gmail.com
1       Jane       Doe        JaneDoe@email.com
2       John       Doe        JohnDoe@email.com

In [13]:
df.columns = [x.lower() for x in df.columns]

In [14]:
df

  first_name last_name                    email
0      Corey   Schafer  CoreyMSchafer@gmail.com
1       Jane       Doe        JaneDoe@email.com
2       John       Doe        JohnDoe@email.com

In [15]:
#make dict
df.rename(columns = {'first_name' : 'first', 'last_name' : 'last'}, inplace = True)

In [16]:
df

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@email.com
2   John      Doe        JohnDoe@email.com

In [17]:
#data in row update
#update single value
df.loc[2] = ['John', 'Smith', 'JohnSmith@emaiil.com']

In [18]:
df

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@email.com
2   John    Smith     JohnSmith@emaiil.com

In [20]:
df.loc[2, ['last', 'email']] =['Doe', 'JohnDoe@emaiil.com']

In [21]:
df

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@email.com
2   John      Doe       JohnDoe@emaiil.com

In [22]:
df.loc[2, 'last']= 'Smith'

In [23]:
df

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@email.com
2   John    Smith       JohnDoe@emaiil.com

In [24]:
df.at[2, 'last'] = 'Doe' #similar to .loc

In [25]:
df

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@email.com
2   John      Doe       JohnDoe@emaiil.com

In [33]:
filt = (df['email'] == 'JohnDoe@email.com')
df.loc[filt, 'last'] = 'Smith'

In [34]:
df

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@email.com
2   John      Doe       JohnDoe@emaiil.com

In [37]:
#multiple rows
df['email']= df['email'].str.lower()

In [38]:
df

   first     last                    email
0  Corey  Schafer  coreymschafer@gmail.com
1   Jane      Doe        janedoe@email.com
2   John      Doe       johndoe@emaiil.com

apply
map
applymap

In [40]:
df['email'].apply(len)

0    23
1    17
2    18
Name: email, dtype: int64

In [44]:
def update_email(email):
    return email.upper()

In [51]:
df['email'] = df['email'].apply(update_email)

In [52]:
df

   first     last                    email
0  Corey  Schafer  COREYMSCHAFER@GMAIL.COM
1   Jane      Doe        JANEDOE@EMAIL.COM
2   John      Doe       JOHNDOE@EMAIIL.COM

In [54]:
#lamda
df['email'] = df['email'].apply(lambda x: x.lower())

In [55]:
df['email'].apply(len)

0    23
1    17
2    18
Name: email, dtype: int64

In [58]:
df.apply(len, axis = 'columns') #whole df

0    3
1    3
2    3
dtype: int64

In [57]:
len(df['email'])

3

In [59]:
df.apply(pd.Series.min)

first                      Corey
last                         Doe
email    coreymschafer@gmail.com
dtype: object

In [60]:
df.apply(lambda x: x.min())

first                      Corey
last                         Doe
email    coreymschafer@gmail.com
dtype: object

In [61]:
df.applymap(len)

   first  last  email
0      5     7     23
1      4     3     17
2      4     3     18

In [62]:
df.applymap(str.lower)

   first     last                    email
0  corey  schafer  coreymschafer@gmail.com
1   jane      doe        janedoe@email.com
2   john      doe       johndoe@emaiil.com

In [63]:
#map works for series

df['first'].map({'Corey' : 'Chris', 'Jane' : 'Mary'})

0    Chris
1     Mary
2      NaN
Name: first, dtype: object

In [66]:
df['first'] = df['first'].replace({'Corey' : 'Chris', 'Jane' : 'Mary'})

In [67]:
df

   first     last                    email
0  Chris  Schafer  coreymschafer@gmail.com
1   Mary      Doe        janedoe@email.com
2   John      Doe       johndoe@emaiil.com